<?php
/**
 * @file:  status.ini.php
 * @brief:  数据库表，状态字段配置
 * @author:  Mark.Pan
 * @version:  0.1
 * @date:  2015-08-26
 */
return [
	// 订单表
	'order' => [
			//订单状态：
			'status' => [
					'1' => '待审核', 
					'2' => '已完成', 
					'3' => '已取消', 
					'4' => '待支付', 
					'5' => '待提货', 
					'6' => '待评价', 
					'7' => '审核不通过', 
					'8' => '拒付', 
					'9' => '已提交支付' 
				], 
			//配送方式：
			'shipping_type' => [
					'1' => '自提', 
					'2' => '配送'
				], 
			// 发票开票状态
			'invoicing_status' => [
					'1' => '未申请', 
					'2' => '已申请', 
					'3' => '已开票'
				], 
	], 

	// 商品表
	'item' => [
		'count_type' => [
			1 => '理计', 
			2 => '磅计'
		], 
		'price_type' => [
			1 => '自提价', 
			2 => '包到价'
		]
	], 
];
